Revit 2024 API
OverrideGraphicSettings.IsSurfaceBackgroundPatternVisible Property
 The visibility of the surface background fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool IsSurfaceBackgroundPatternVisible { get; }
Visual Basic
Public ReadOnly Property IsSurfaceBackgroundPatternVisible As Boolean
	Get
Visual C++
public:
property bool IsSurfaceBackgroundPatternVisible {
	bool get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace